#include <stdio.h>
#include <string.h>
#include "dbf.h"
#include "unit.h"
#include "fleet.h"
#include "func.h"

struct pref pref;
struct CHEAT cheat;
struct HEAD head;
struct UNIT devUnit[165];
struct WPNGUN wpnGun[144];
struct ARMO armo[124];
struct UNIT unit001[525];
struct FLEET JPfleet[16];
struct FLEET USfleet[16];
struct FLEET UKfleet[16];
struct FLEET DEfleet[16];
struct ELEMENT JPelem[850];
struct ELEMENT USelem[2040];
struct ELEMENT UKelem[600];
struct ELEMENT DEelem[1550];
struct ELEMENT RUelem[400];
struct ELEMENT NLelem[45];
struct ELEMENT AUelem[100];
struct ELEMENT THelem[25];
struct ELEMENT INelem[80];
struct ELEMENT CHelem[100];
char   fUNK11[12409];
struct FILEMAP fileMap;

char lineBuf[1024];
char jpString[][80] = {
	"内部エラー",				// #0
	"cheatprf.txtに誤りがあります.",	// #1
	"メモリ不足",				// #2
	"RETURNキーを押すと終了します......",	// #3
	"国力",					// #4
	"国民意識",				// #5
	"工業力",				// #6
	"技術力",				// #7
	"航空機",				// #8
	"日",					// #9
	"→",					// #10
	"艦船",					// #11
	"が作れません.",			// #12
	"が開けません.",			// #13
	"は内容が空か,又はバージョンが違います.",	// #14
	"wpn.db2が開けません.",			// #15
	"wpn.db2に異常があります.",		// #16
	"wpgun.db2が開けません.",		// #17
	"wpgun.db2に異常があります.",		// #18
	"口径砲",		// #19
	"∞",			// #20
	"海里(水上)",	// #21
	"海里(水中)",	// #22
	"作業ファイル",	// #23
	"海里",			// #24
	"ノット(水上)",	// #25
	"ノット(水上)",	// #26
	"ノット",	// #27
	"秒",		// #28
	"分",		// #29
	"unit001.db2が開けません.",	// #30
	"unit001.db2に異常があります.",	// #31
	"有り",				// #32
	"無し",				// #33
	"搭載兵器名          弾数    射数    射界(前/後/側)％    射程距離    装填時間", // #34
	"の書き込み中にエラー.", 	// #35
	"が消去できません.",		// #36
	"の更新ができません.",	// #37
	"戦術モードでは",		// #38
	"の指定のみを処理します.",// #39
};

char unitArmy[][16] = {
	"陸上部隊",	// #01
};

char unitSub[][16] = { 
	"潜水艦",	// #20
	"特殊潜水艦",	// #21
	"輸送潜水艦",	// #22
	"支援潜水艦",	// #23
	"補給潜水艦",	// #24
	"原子力潜水艦",	// #25
	"海中要塞",	// #26
};

char unitAir[][16] = {
	"艦上戦闘機",	// #40
	"艦上爆撃機",	// #41
	"艦上攻撃機",	// #42
	"艦上偵察機",	// #43
	"艦上雷撃機",	// #44
	"戦闘機",	// #45
	"襲撃機",	// #46
	"偵察機",	// #47
	"爆撃機",	// #48
	"局地戦闘機",	// #49
	"超重飛行艇",	// #4A
	"飛行艇",	// #4B
	"戦略爆撃機",	// #4C
	"対潜哨戒機",	// #4D
	"水上戦闘機",	// #4E
	"水上攻撃機",	// #4F
	"水上爆撃機",	// #50
	"水上偵察機",	// #51
	"陸上攻撃機",	// #52
	"陸上爆撃機",	// #53
	"攻撃機",	// #54
	"特殊爆撃機",	// #55
	"哨戒飛行艇",	// #56
	"陸上偵察機",	// #57
	"空中戦車",	// #58
	"夜間戦闘機",	// #59
	"円盤機",	// #5A
	"原子力爆撃機",	// #5B
	"重要撃機",	// #5C
};

char unitShip[][16] = {
	"戦艦",			// #80
	"鹵獲戦艦",		// #81
	"空母",			// #82
	"軽空母",		// #83
	"水上機母艦",		// #84
	"重巡洋艦",		// #85
	"軽巡洋艦",		// #86
	"駆逐艦",		// #87
	"防空駆逐艦",		// #88
	"原子力戦艦",		// #89
	"原子力航空戦艦",	// #8A
	"原子力空母",		// #8B
	"原子力巡洋艦",		// #8C
	"イージス巡洋艦",	// #8D
	"イージス駆逐艦",	// #8E
	"氷山空母",		// #8F
	"輸送船",		// #90
	"イ－ジス戦艦",		// #91
};

char srcShip[][16] = {
	"艦種:",			// #0
	"国名:",				// #1
	"艦名:",			// #2
	"建造費用:",			// #3 ...P
	"航続距離:",			// #4 ...RI(SUIJOU)
	"航続距離:",			// #5 ...RI(SUIJOU)
	"機関:",			// #6
	"搭載タイプ:",			// #7
	"搭載容量:",			// #8
	"登場技術力:",			// #9 ...P
	"耐久:",			// #10
	"防御:",			// #11 ...cmBOUGYO
	"防御方式:",			// #12
	"最大速力:",			// #13 ...NOT(SUIJOU)
	"最大速力:",			// #14 ...NOT(SUICHYU)
	"浮上速度:",			// #15 ...BYOU/10m
	"潜航速度:",			// #16 ...BYOU/10m
	"最大潜航深度:",		// #17 ...m
	"魚雷発射深度:",		// #18
	"対空索敵:",			// #19 ...RI
	"対水上:",			// #20 ...RI
	"対水中:",			// #21 ...RI
	"電波探信儀:",			// #22
	"電波照準儀:",			// #23
	"電波妨害装置:",		// #24
	"発艦時間:",			// #25 ...HUN
	"回避力:",			// #26
	"補給物資:",			// #27 ...P
	"登場条件:",			// #28
};

char engName[][10] = {
	"ジーゼル1",	// #0
	"ジーゼル2",	// #1
	"ワルター",	// #2
	"原子力",	// #3
	"航空機1",	// #4
	"航空機2",	// #5
	"潜水艦",	// #6
	"陸上部隊",	// #7
	"不明",		// #8
};

char loadName [][16] = {// toLoad    Load      str#
	"空母艦載機",	//   80       80        0
	"潜水艦水上機",	//   64       40        1
	"水上機",	//   20       20        2
	"陸上部隊",	//   08       08        3
	"特殊爆撃機",	//   04       04        4
	"空母/水上機",	//   a0     80/20       5
};

char countryName[][16] = {
	"日本",			// #0
	"アメリカ",		// #1
	"イギリス",		// #2
	"ドイツ",		// #3
	"ソ連",			// #4
	"オランダ",		// #5
	"オーストラリア",// #6
	"タイ",			// #7
	"インド",		// #8
	"中国",			// #9
	"その他",		// #10
};

char armorName[][10] = {
	"なし",		// #0
	"61cm防御",	// #1
	"56cm防御",	// #2
	"51cm防御",	// #3
	"46cm防御",	// #4
	"43cm防御",	// #5
	"41cm防御",	// #6
	"38cm防御",	// #7
	"36cm防御",	// #8
	"31cm防御",	// #9
	"25cm防御",	// #10
	"20cm防御",	// #11
	"15cm防御",	// #12
	"14cm防御",	// #13
	"12cm防御",	// #14
	"10cm防御",	// #15
};

char armorTypeName[][10] = {
	"完全防御",
	"集中防御",
	"なし",
};

char shootHighName[][8] = {
	"超深度",	// #00  #F5
	"深深度",	// #01  #F6
	"浅深度",	// #02  #F7
	"潜深度",	// #03  #F8
	"０ｍ",		// #04  #F9
	"超低空",	// #05  #FA
	"低空",		// #06  #FB
	"中空",		// #07  #FC
	"高空",		// #08  #FD
	"高高空",	// #09  #FE
	"超高空",	// #0A  #FF
	"不可",		// #0B  #00
	"可",		// #0C  #01
};

char pTypeName[][16] = {
	"共通",		// #0
	"ドイツ同盟",	// #1
	"ドイツ非同盟",	// #2
};